src/Catalogs/ИС_ВБ_Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_ВБ_Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзЛК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладWB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСкладаWB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКГТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиИзГруппыСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяГруппаСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСхемуFBO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяЯчейкаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьОрдерНаОтгрузку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтрокиРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскоеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозчикПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОсновнойСкладВЗаказах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОстаткаДляПереходаНаFBS</Name>
					<Comment>ИнфоСофт Макарова Н.Е. 11.04.2025 УА#94883</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппаСкладов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаправленияДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ИС_ВБ_ТипыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ВБ_ТипыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBW</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EDBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CnC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FBO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_ВБ_ТипыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ВБ_ТипыТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МГТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СГТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КГТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_ВБ_Склады/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 06.02.25 УА #92406
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	IDСклада = Формат(Объект.Код, "ЧГ=");
	Элементы.Код.Видимость = Ложь;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура ВыгружатьОстаткиИзГруппыСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//+ ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78580	
	СтруктураПараметров = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки();
	СтруктураПараметров.ИмяРеквизитаАдресаДоставки 				= "АдресДоставки";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначенияПолей = "АдресДоставкиЗначенияПолей";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначение 		= "АдресДоставкиЗначение";  
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		СтруктураПараметров,
		СтандартнаяОбработка);
		
	//ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	//    Элемент,
	//	Объект,
	//	"АдресДоставки",
	//	СтандартнаяОбработка);
	//- ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78580
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей,
		Объект.АдресДоставкиЗначение);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 05.04.23 УА #57127
&НаКлиенте
Процедура ОбщаяГруппаСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 05.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура АвтоматическиСоздаватьОрдерНаОтгрузкуПриИзменении(Элемент)
	УстановитьВидимостьОрдернойСхемы();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
&НаКлиенте
Процедура ТипДоставкиПриИзменении(Элемент)
	
	Если Объект.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.FBO") Тогда
		
		Объект.ИспользоватьСхемуFBO 				= Ложь;
		Объект.ИспользоватьКГТ 						= Ложь;		

		Элементы.ИспользоватьСхемуFBO.Доступность 	= Ложь;
		Элементы.ИспользоватьКГТ.Доступность 		= Ложь;
			
	Иначе
		
		Объект.ИспользоватьСхемуFBO 				= Истина;
		Объект.ИспользоватьКГТ 						= Истина;		
		
		Элементы.ИспользоватьСхемуFBO.Доступность 	= Истина;
		Элементы.ИспользоватьКГТ.Доступность 		= Истина;	
		
	КонецЕсли;  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.FBO") Тогда
		Объект.ИспользоватьСхемуFBO = Ложь;
		Объект.ИспользоватьКГТ = Ложь;		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 05.04.23 УА #57127
&НаКлиенте
Процедура УстановитьОформление()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Профиль.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.ТипДоставки.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.ТипТоварв.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОбщаяГруппаСкладов) Тогда
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Ложь;
		Элементы.ГруппаСкладов.Видимость = Ложь;
		//+ ИнфоСофт Стояк Ю.К. 09.10.2023 УА #63776
		Объект.ВыгружатьОстаткиИзГруппыСкладов = Ложь;
		//- ИнфоСофт Стояк Ю.К. 09.10.2023 УА #63776
	Иначе
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Объект.ВыгружатьОстаткиИзГруппыСкладов;	
	КонецЕсли; 
	//+ ИнфоСофт Сумин Д.В. 11.09.2023 УА #61973
	Если Объект.АвтоматическиСоздаватьОрдерНаОтгрузку Тогда
		Элементы.СкладскоеПомещение.Видимость = Истина;
		Элементы.СтатусРасходногоОрдера.Видимость = Истина;
		Элементы.СтатусСтрокиРасходногоОрдера.Видимость = Истина;
	Иначе
		Элементы.СкладскоеПомещение.Видимость = Ложь;
		Элементы.СтатусРасходногоОрдера.Видимость = Ложь;
		Элементы.СтатусСтрокиРасходногоОрдера.Видимость = Ложь;
	КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 11.09.2023 УА #61973
	
	//+ ИнфоСофт Заварин К.В. 30.01.25 УА #88005
	Если Объект.ВыгружатьОстаткиИзГруппыСкладов Тогда
		Элементы.ИспользоватьОсновнойСкладВЗаказах.Видимость = Истина;	
	Иначе
		Элементы.ИспользоватьОсновнойСкладВЗаказах.Видимость = Ложь;
		Объект.ИспользоватьОсновнойСкладВЗаказах 			 = Ложь;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 30.01.25 УА #88005
	
	//+ ИнфоСофт Ивонин К.А. 06.02.25 УА #92406
	Элементы.ИспользоватьКГТ.Видимость 
		= Объект.ТипТовара = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыТоваров.СГТ");
	//- ИнфоСофт Ивонин К.А. 06.02.25 УА #92406	 
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если Объект.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.FBO") Тогда				
		Элементы.ИспользоватьСхемуFBO.Доступность 	= Ложь;
		Элементы.ИспользоватьКГТ.Доступность 		= Ложь;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
    УстановитьВидимостьОрдернойСхемы();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 05.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура УстановитьВидимостьОрдернойСхемы()
	Элементы.СкладскоеПомещение.Видимость 			= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусРасходногоОрдера.Видимость 		= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусСтрокиРасходногоОрдера.Видимость = Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Сумин Д.В. 11.09.2023 УА #61973
&НаКлиенте
Процедура СкладскоеПомещениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПомещение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина); 
	
	ОткрытьФорму("Справочник.СкладскиеПомещения.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеВыбора);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 11.09.2023 УА #61973   

//+ ИнфоСофт Сумин Д.В. 11.09.2023 УА #61973
&НаКлиенте
Процедура ОбработатьВыборПомещение(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СкладскоеПомещение =  РезультатЗакрытия;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 11.09.2023 УА #61973

#КонецОбласти
